using System;

// Исполнитель Калькулятор преобразует целое число, записанное на экране.У исполнителя две команды, каждой команде присвоен номер:
// Прибавь 1 2. 
// Умножь на 2 Первая команда увеличивает число на экране на 1, вторая увеличивает это число в 2 раза.
// Сколько существует программ, которые число 3 преобразуют в число 20? 
// а) с использованием массива; б) с использованием рекурсии.

// Коновальцев Александр

namespace Task3
{
    class MainClass
    {
        public static void Main(string[] args)
        {

        }
    }
}